; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-19)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite3 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	satellite4 - satellite
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	image4 - mode
	spectrograph6 - mode
	infrared2 - mode
	image5 - mode
	thermograph1 - mode
	infrared7 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star1 - direction
	GroundStation4 - direction
	Star2 - direction
	Star3 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
	Star23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet21)
	(supports instrument3 thermograph1)
	(supports instrument3 image5)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph6)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image5)
	(supports instrument6 infrared7)
	(calibration_target instrument6 Star3)
	(supports instrument7 spectrograph6)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet21)
	(supports instrument8 infrared3)
	(supports instrument8 infrared7)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star3)
	(supports instrument10 image4)
	(supports instrument10 infrared7)
	(supports instrument10 image5)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star2)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star3)
	(supports instrument13 infrared3)
	(calibration_target instrument13 Star2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(on_board instrument12 satellite2)
	(on_board instrument13 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(supports instrument14 thermograph1)
	(supports instrument14 infrared2)
	(calibration_target instrument14 GroundStation4)
	(supports instrument15 infrared2)
	(calibration_target instrument15 Star1)
	(supports instrument16 image4)
	(supports instrument16 spectrograph6)
	(calibration_target instrument16 Star2)
	(supports instrument17 image4)
	(supports instrument17 infrared7)
	(supports instrument17 image5)
	(calibration_target instrument17 GroundStation0)
	(supports instrument18 image4)
	(supports instrument18 spectrograph6)
	(calibration_target instrument18 Star2)
	(supports instrument19 infrared3)
	(supports instrument19 infrared7)
	(supports instrument19 spectrograph6)
	(calibration_target instrument19 Star3)
	(supports instrument20 infrared3)
	(supports instrument20 infrared2)
	(calibration_target instrument20 Star2)
	(supports instrument21 infrared2)
	(supports instrument21 thermograph1)
	(calibration_target instrument21 GroundStation4)
	(on_board instrument14 satellite3)
	(on_board instrument15 satellite3)
	(on_board instrument16 satellite3)
	(on_board instrument17 satellite3)
	(on_board instrument18 satellite3)
	(on_board instrument19 satellite3)
	(on_board instrument20 satellite3)
	(on_board instrument21 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon20)
	(supports instrument22 thermograph1)
	(supports instrument22 image5)
	(calibration_target instrument22 Star2)
	(supports instrument23 infrared7)
	(supports instrument23 thermograph1)
	(calibration_target instrument23 Star3)
	(supports instrument24 infrared3)
	(supports instrument24 spectrograph0)
	(calibration_target instrument24 GroundStation0)
	(on_board instrument22 satellite4)
	(on_board instrument23 satellite4)
	(on_board instrument24 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
)
(:goal (and
	(pointing satellite0 Planet17)
	(have_image Phenomenon5 infrared7)
	(have_image Phenomenon5 image4)
	(have_image Phenomenon7 thermograph1)
	(have_image Planet9 spectrograph0)
	(have_image Planet9 spectrograph6)
	(have_image Star10 infrared3)
	(have_image Star10 spectrograph6)
	(have_image Phenomenon11 infrared2)
	(have_image Star12 spectrograph6)
	(have_image Star12 thermograph1)
	(have_image Phenomenon13 infrared7)
	(have_image Phenomenon13 infrared2)
	(have_image Star14 infrared2)
	(have_image Planet15 infrared2)
	(have_image Star16 image4)
	(have_image Planet17 image5)
	(have_image Planet17 image4)
	(have_image Star18 infrared2)
	(have_image Star19 infrared3)
	(have_image Star19 thermograph1)
	(have_image Phenomenon20 spectrograph0)
	(have_image Planet21 infrared3)
	(have_image Planet21 image5)
	(have_image Planet22 infrared2)
	(have_image Star23 infrared2)
	(have_image Phenomenon24 spectrograph6)
	(have_image Phenomenon24 image5)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 28
2. (turn_to satellite2 star2 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star2)
   goals met: 0 of 28
3. (switch_on instrument11 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument11)
   goals met: 0 of 28
4. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 28
5. (turn_to satellite1 groundstation4 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 28
6. (turn_to satellite4 star2 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star2)
   goals met: 0 of 28
7. (switch_on instrument22 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument22)
   goals met: 0 of 28
8. (calibrate satellite2 instrument11 star2)
   added: (calibrated instrument11)
   goals met: 0 of 28
9. (calibrate satellite1 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 0 of 28
10. (calibrate satellite4 instrument22 star2)
   added: (calibrated instrument22)
   goals met: 0 of 28
11. (turn_to satellite2 star23 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star23)
   goals met: 0 of 28
12. (turn_to satellite1 star10 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star10)
   goals met: 0 of 28
13. (turn_to satellite3 star3 phenomenon20)
   deleted: (pointing satellite3 phenomenon20)
   added: (pointing satellite3 star3)
   goals met: 0 of 28
14. (turn_to satellite4 phenomenon24 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon24)
   goals met: 0 of 28
15. (take_image satellite2 star23 instrument11 infrared2)
   added: (have_image star23 infrared2)
   goals met: 1 of 28
16. (switch_on instrument19 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument19)
   goals met: 1 of 28
17. (turn_to satellite0 groundstation0 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 28
18. (calibrate satellite3 instrument19 star3)
   added: (calibrated instrument19)
   goals met: 1 of 28
19. (turn_to satellite3 star19 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star19)
   goals met: 1 of 28
20. (take_image satellite3 star19 instrument19 infrared3)
   added: (have_image star19 infrared3)
   goals met: 2 of 28
21. (take_image satellite4 phenomenon24 instrument22 image5)
   added: (have_image phenomenon24 image5)
   goals met: 3 of 28
22. (take_image satellite1 star10 instrument5 spectrograph6)
   added: (have_image star10 spectrograph6)
   goals met: 4 of 28
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 28
24. (turn_to satellite1 phenomenon20 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon20)
   goals met: 4 of 28
25. (turn_to satellite4 planet17 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 planet17)
   goals met: 4 of 28
26. (take_image satellite1 phenomenon20 instrument5 spectrograph0)
   added: (have_image phenomenon20 spectrograph0)
   goals met: 5 of 28
27. (turn_to satellite2 star14 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 star14)
   goals met: 5 of 28
28. (take_image satellite4 planet17 instrument22 image5)
   added: (have_image planet17 image5)
   goals met: 6 of 28
29. (take_image satellite2 star14 instrument11 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 28
30. (turn_to satellite1 planet9 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 planet9)
   goals met: 7 of 28
31. (turn_to satellite4 planet21 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet21)
   goals met: 7 of 28
32. (take_image satellite1 planet9 instrument5 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 8 of 28
33. (take_image satellite4 planet21 instrument22 image5)
   added: (have_image planet21 image5)
   goals met: 9 of 28
34. (take_image satellite1 planet9 instrument5 spectrograph6)
   added: (have_image planet9 spectrograph6)
   goals met: 10 of 28
35. (turn_to satellite4 phenomenon7 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 phenomenon7)
   goals met: 10 of 28
36. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 10 of 28
37. (take_image satellite1 star12 instrument5 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 11 of 28
38. (take_image satellite4 phenomenon7 instrument22 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 12 of 28
39. (take_image satellite1 star12 instrument5 spectrograph6)
   added: (have_image star12 spectrograph6)
   goals met: 13 of 28
40. (turn_to satellite2 planet22 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 planet22)
   goals met: 13 of 28
41. (take_image satellite2 planet22 instrument11 infrared2)
   added: (have_image planet22 infrared2)
   goals met: 14 of 28
42. (turn_to satellite0 phenomenon5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon5)
   goals met: 14 of 28
43. (turn_to satellite1 phenomenon24 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon24)
   goals met: 14 of 28
44. (turn_to satellite4 star19 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star19)
   goals met: 14 of 28
45. (take_image satellite1 phenomenon24 instrument5 spectrograph6)
   added: (have_image phenomenon24 spectrograph6)
   goals met: 15 of 28
46. (take_image satellite0 phenomenon5 instrument0 image4)
   added: (have_image phenomenon5 image4)
   goals met: 16 of 28
47. (turn_to satellite2 planet15 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 planet15)
   goals met: 16 of 28
48. (take_image satellite4 star19 instrument22 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 17 of 28
49. (take_image satellite2 planet15 instrument11 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 18 of 28
50. (turn_to satellite0 star18 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star18)
   goals met: 18 of 28
51. (turn_to satellite2 phenomenon11 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon11)
   goals met: 18 of 28
52. (take_image satellite0 star18 instrument0 infrared2)
   added: (have_image star18 infrared2)
   goals met: 19 of 28
53. (turn_to satellite0 phenomenon13 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 phenomenon13)
   goals met: 19 of 28
54. (take_image satellite0 phenomenon13 instrument0 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 20 of 28
55. (turn_to satellite0 star16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star16)
   goals met: 20 of 28
56. (take_image satellite0 star16 instrument0 image4)
   added: (have_image star16 image4)
   goals met: 21 of 28
57. (turn_to satellite0 planet17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet17)
   goals met: 22 of 28
58. (take_image satellite2 phenomenon11 instrument11 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 23 of 28
59. (turn_to satellite3 phenomenon13 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 phenomenon13)
   goals met: 23 of 28
60. (take_image satellite0 planet17 instrument0 image4)
   added: (have_image planet17 image4)
   goals met: 24 of 28
61. (take_image satellite3 phenomenon13 instrument19 infrared7)
   added: (have_image phenomenon13 infrared7)
   goals met: 25 of 28
62. (turn_to satellite3 star10 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 star10)
   goals met: 25 of 28
63. (take_image satellite3 star10 instrument19 infrared3)
   added: (have_image star10 infrared3)
   goals met: 26 of 28
64. (turn_to satellite3 planet21 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet21)
   goals met: 26 of 28
65. (take_image satellite3 planet21 instrument19 infrared3)
   added: (have_image planet21 infrared3)
   goals met: 27 of 28
66. (turn_to satellite3 phenomenon5 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 phenomenon5)
   goals met: 27 of 28
67. (take_image satellite3 phenomenon5 instrument19 infrared7)
   added: (have_image phenomenon5 infrared7)
   goals met: 28 of 28
